# Reading data
Read the train.csv file as a pandas dataframe.

In [2]:
import pandas as pd

titanic = pd.read_csv('data/train.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Indexing
1. Create a function that returns the name of a passenger given their PassengerId.
2. Create a function that returns the PassengerId of a passenger given their Name.
3. Print a message with the ID of passenger **Montvila, Rev. Juozas** with the following format: 'The ID pf passenger Montvila, Rev. Juozas is ##'
4. Print a message with the name of the passenger with ID **42** with the following format: 'The passenger with ID 42 is X'

In [45]:
import titanic_fun 

titanic_fun.get_Passenger_name(titanic, 1)

'Braund, Mr. Owen Harris'

In [46]:
get_Passenger_ID(titanic, "Braund, Mr. Owen Harris")

1

In [47]:
id = titanic.loc[titanic.Name == 'Montvila, Rev. Juozas']['PassengerId'].values[0]
print('The ID pf passenger Montvila, Rev. Juozas is',id)

The ID pf passenger Montvila, Rev. Juozas is 887

In [48]:
name = titanic.iloc[41]['Name']
print('The name of passenger with ID 42 is',name)

The name of passenger with ID 42 is Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)

5. Print all information about the oldest passenger.

In [11]:
oldest_passenger = titanic.loc[titanic['Age'].idxmax()]
print(oldest_passenger)

PassengerId                                     631
Survived                                          1
Pclass                                            1
Name           Barkworth, Mr. Algernon Henry Wilson
Sex                                            male
Age                                            80.0
SibSp                                             0
Parch                                             0
Ticket                                        27042
Fare                                           30.0
Cabin                                           A23
Embarked                                          S
Name: 630, dtype: object

# Subseting
We are asked to share data for analysis by a third party. Since our dataset contains personal details, we only want to share with them the following information: ticket classes, fares and port of embarkation. We are asked to deliver a sample of the first 100 rows of this dataset.

6. Create and save the new dataset in **data/port_fares.csv**.

In [15]:
info = titanic[['Pclass', 'Fare', 'Embarked']].head(100)
info.to_csv('data/port_fares.csv', index=False)

# Vectorizacion

In [16]:
import numpy as np
np. arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [17]:
import time
start = time.time()
total = 0
for i in np.arange(10000000):
    total = i + total
print(total)
end = time.time()
print(end - start)

49999995000000
0.6413521766662598

In [18]:
start = time.time()

print(np.sum(np.arange(10000000)))

end = time.time()
print(end - start)

49999995000000
0.014181852340698242

# Counting
7. We want to know if there were any survivors over the age of 60, print all of their information.
8. How many people over 60 survived?
9. What percentage of people over 60 survived?

In [15]:
pasajeros_60 = titanic.loc[titanic['Age']>60]
sobrevivieron = pasajeros_60.loc[pasajeros_60['Survived'] == 1]
print(sobrevivieron)

     PassengerId  Survived  Pclass                                       Name  \
275          276         1       1          Andrews, Miss. Kornelia Theodosia
483          484         1       3                     Turkula, Mrs. (Hedwig)
570          571         1       2                         Harris, Mr. George
630          631         1       1       Barkworth, Mr. Algernon Henry Wilson
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)

        Sex   Age  SibSp  Parch       Ticket     Fare Cabin Embarked  Mayor_60
275  female  63.0      1      0        13502  77.9583    D7        S      True
483  female  63.0      0      0         4134   9.5875   NaN        S      True
570    male  62.0      0      0  S.W./PP 752  10.5000   NaN        S      True
630    male  80.0      0      0        27042  30.0000   A23        S      True
829  female  62.0      0      0       113572  80.0000   B28      NaN      True

In [63]:
print('El numero de pasajeros que sobrevivieron es', len(sobrevivieron))

El numero de pasajeros que sobrevivieron es 5

In [64]:
print('El porcentaje de pasajeros que sobrevivieron es', round(len(sobrevivieron)/len(pasajeros_60)*100,2),'%')

El porcentaje de pasajeros que sobrevivieron es 22.73 %

# Women and children first?
10. Find out if women and children were more likely to survive.

11. Write a function that returns the percentage of people that survived from a subset given as a boolean Pandas series.

In [32]:
pasajeros_18 = titanic.loc[titanic['Age']<18]
print("Tabla de niños que sobrevivieron:", '\n', pasajeros_18['Survived'].value_counts())
pasajeros_18mas = titanic.loc[titanic['Age']>=18]
print("Tabla de mujeres y hombres que sobrevivieron excluyendo a los niños:", '\n',pasajeros_18mas.groupby(['Sex','Survived'])['Survived'].count())

Tabla de niños que sobrevivieron:
 Survived
1    61
0    52
Name: count, dtype: int64
Tabla de mujeres y hombres que sobrevivieron excluyendo a los niños:
 Sex     Survived
female  0            47
        1           159
male    0           325
        1            70
Name: Survived, dtype: int64

In [39]:
print("El porcentaje de personas que sobrevivieron es:",round(titanic['Survived'].value_counts()[1]/ len(titanic) *100,2),'%')

El porcentaje de personas que sobrevivieron es: 38.38 %

# Summarizing

12. What is the median age of the passengers?
13. How many passengers embarked from each port?

14. Generate two hypotheses about how does the survival rate differ among groups of passengers. Write your code to explore both hypotheses.

In [6]:
print(titanic['Age'].median())

28.0

In [12]:
titanic.groupby("Embarked").size()

Embarked
C    168
Q     77
S    644
dtype: int64

In [13]:
mayor_60 = titanic['Mayor_60'] = titanic['Age'] > 60
titanic.groupby([mayor_60,'Survived'])['Survived'].count()

Age    Survived
False  0           532
       1           337
True   0            17
       1             5
Name: Survived, dtype: int64

In [14]:
titanic.groupby(['Sex','Survived'])['Survived'].count()

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
Name: Survived, dtype: int64